In [2]:
from IPython.core.display import HTML
HTML("<style>.container { width:100% !important; float:center}</style>")

In [3]:
from __future__ import division, print_function

import math
import pandas as pd
import numpy as np

In [4]:
mat = np.random.randint(10,size=(5,5))
mat

array([[9, 6, 8, 0, 4],
       [7, 5, 9, 2, 7],
       [2, 1, 5, 7, 2],
       [3, 6, 3, 0, 1],
       [5, 0, 2, 7, 4]])

In [5]:
df = pd.DataFrame(mat)
df

   0  1  2  3  4
0  9  6  8  0  4
1  7  5  9  2  7
2  2  1  5  7  2
3  3  6  3  0  1
4  5  0  2  7  4

In [6]:
df.test_all_ones = 1
df
# fails to make a new column

   0  1  2  3  4
0  9  6  8  0  4
1  7  5  9  2  7
2  2  1  5  7  2
3  3  6  3  0  1
4  5  0  2  7  4

v this works, though

In [7]:
df['test_all_ones'] = 1
df

   0  1  2  3  4  test_all_ones
0  9  6  8  0  4              1
1  7  5  9  2  7              1
2  2  1  5  7  2              1
3  3  6  3  0  1              1
4  5  0  2  7  4              1

In [8]:
df['test2'] = df.test_all_ones
df

   0  1  2  3  4  test_all_ones  test2
0  9  6  8  0  4              1      1
1  7  5  9  2  7              1      1
2  2  1  5  7  2              1      1
3  3  6  3  0  1              1      1
4  5  0  2  7  4              1      1

In [9]:
df['col_to_transform'] = df.loc[:, 4]
df

   0  1  2  3  4  test_all_ones  test2  col_to_transform
0  9  6  8  0  4              1      1                 4
1  7  5  9  2  7              1      1                 7
2  2  1  5  7  2              1      1                 2
3  3  6  3  0  1              1      1                 1
4  5  0  2  7  4              1      1                 4

^ make a new column <br>
.loc[ ] because you can't access a column with number for a name using the shortcut methods (intentional so pandas doesn't get confused as to whether you're calling the index loc or name)

test assign some NaN vals

In [33]:
df.loc[[1,3],'col_to_transform'] = np.NaN
df

   0  1  2  3  4  test_all_ones  col_to_transform
0  9  6  3  7  8              1               8.0
1  9  6  3  0  1              1               NaN
2  2  8  3  1  3              1               3.0
3  6  4  3  0  6              1               NaN
4  7  3  8  8  7              1               7.0

In [34]:
df.col_to_transform.type = float

In [35]:
df

   0  1  2  3  4  test_all_ones  col_to_transform
0  9  6  3  7  8              1               8.0
1  9  6  3  0  1              1               NaN
2  2  8  3  1  3              1               3.0
3  6  4  3  0  6              1               NaN
4  7  3  8  8  7              1               7.0

In [36]:
def transform_item_quantity(item):
    
    if type(item) == float:
        if math.isnan(item):
            return np.nan_to_num(item)
        else:
            return float(item)
    else: 
        return 'sorry hal cant do that'

^ one thing you usally want to do (maybe you left this out for simplicity) if you have an 'if' statement alone is to make some 'else' catchall, so if will tell you that your 'if' missed something

^ Here, you might also want to add an 'if' for strings, jsut in case? but your data may be good enough that you don't have to worry, either

In [37]:
df['col_to_transform'] = df['col_to_transform'].apply(transform_item_quantity)
df

   0  1  2  3  4  test_all_ones  col_to_transform
0  9  6  3  7  8              1               8.0
1  9  6  3  0  1              1               0.0
2  2  8  3  1  3              1               3.0
3  6  4  3  0  6              1               0.0
4  7  3  8  8  7              1               7.0

One thing, looking at your code - is data.Qty3 = data.Qty2 actually giving you a new column? I believe that to create a new column, or to assign values
to the column as a w you have to use the df['columnname'] = xxx  notation; the df.columnname shortcut only works to access data. 

Here, it might also be more effective is to create a function that does what you want, create a new column (data['Qty3'] = data.Qty2) and then use the apply function (df[<column>] = df[<column>].apply(<function>))